docs/references/learning-log.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-26 Thu 20:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning log</title>
<meta name="author" content="Roger Farrell" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../template/styles.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Learning log</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-left">description</th>
<th scope="col" class="org-left">references</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2026-02-26</td>
<td class="org-left">There are guides for installing Guix on Raspberry Pi</td>
<td class="org-left"><a href="https://me.literatelisp.eu/guix-system-on-a-raspberry-pi-3b.html">https://me.literatelisp.eu/guix-system-on-a-raspberry-pi-3b.html</a></td>
</tr>

<tr>
<td class="org-right">2026-02-26</td>
<td class="org-left">A great Emacs ERC and ZNC walk-through</td>
<td class="org-left"><a href="https://notes.secretsauce.net/notes/2014/10/08_znc-and-erc.html">https://notes.secretsauce.net/notes/2014/10/08_znc-and-erc.html</a></td>
</tr>

<tr>
<td class="org-right">2026-02-26</td>
<td class="org-left">In Guile, you can modify the load path programmatically with <code>(add-to-load-path &lt;string&gt;)</code>.</td>
<td class="org-left"><a href="guile.html#Load-Paths">info "(guile) Load Paths"</a>, <a href="https://trop.in/blog/how-to-set-up-guile-load-path">https://trop.in/blog/how-to-set-up-guile-load-path</a></td>
</tr>

<tr>
<td class="org-right">2026-02-26</td>
<td class="org-left">Guile Hoot has brought the REPL to the browser!</td>
<td class="org-left"><a href="https://spritely.institute/news/hoot-0-8-0-released.html">https://spritely.institute/news/hoot-0-8-0-released.html</a></td>
</tr>

<tr>
<td class="org-right">2026-02-26</td>
<td class="org-left">In Guix System, the root Guix profile is generally not used</td>
<td class="org-left"><a href="https://lists.gnu.org/archive/html/help-guix/2024-08/msg00063.html">https://lists.gnu.org/archive/html/help-guix/2024-08/msg00063.html</a></td>
</tr>

<tr>
<td class="org-right">2026-02-26</td>
<td class="org-left">For Guix, some tips for layering profiles</td>
<td class="org-left"><a href="https://www.futurile.net/2022/12/23/guix-profiles-layering-at-login/">https://www.futurile.net/2022/12/23/guix-profiles-layering-at-login/</a></td>
</tr>

<tr>
<td class="org-right">2026-02-24</td>
<td class="org-left">In Bash, run <code>who</code> to see all active sessions.</td>
<td class="org-left"><a href="shell:man%20who">shell:man%20who</a></td>
</tr>

<tr>
<td class="org-right">2026-02-24</td>
<td class="org-left">In Guix, run <code>sudo -i guix pull</code> to update the root guix profile.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2026-02-23</td>
<td class="org-left">In Emacs evil mode, <code>\</code> executes the next binding in <code>emacs-state</code>!</td>
<td class="org-left"><a href="help:evil-execute-in-emacs-state">help:evil-execute-in-emacs-state</a></td>
</tr>

<tr>
<td class="org-right">2026-02-20</td>
<td class="org-left">The first half of the prior article</td>
<td class="org-left"><a href="https://lambdanil.github.io/Guix_Dive/">https://lambdanil.github.io/Guix_Dive/</a></td>
</tr>

<tr>
<td class="org-right">2026-02-20</td>
<td class="org-left">For Guix, some really interesting inspections of services</td>
<td class="org-left"><a href="https://lambdanil.github.io/Guix_Dive_2/">https://lambdanil.github.io/Guix_Dive_2/</a></td>
</tr>

<tr>
<td class="org-right">2026-02-18</td>
<td class="org-left">Random Guix tips</td>
<td class="org-left"><a href="https://lambdanil.github.io/Guix_Mistakes/">https://lambdanil.github.io/Guix_Mistakes/</a></td>
</tr>

<tr>
<td class="org-right">2026-02-18</td>
<td class="org-left">For PDFs, an in-depth explanation of tagged PDFs</td>
<td class="org-left"><a href="https://www.overleaf.com/learn/latex/An_introduction_to_tagged_PDF_files%3A_internals_and_the_challenges_of_accessibility">https://www.overleaf.com/learn/latex/An_introduction_to_tagged_PDF_files%3A_internals_and_the_challenges_of_accessibility</a></td>
</tr>

<tr>
<td class="org-right">2026-02-18</td>
<td class="org-left">Another piece about secrets in Guix</td>
<td class="org-left"><a href="https://compress.cafe/blog/guix_home_secrets.html">https://compress.cafe/blog/guix_home_secrets.html</a></td>
</tr>

<tr>
<td class="org-right">2026-02-18</td>
<td class="org-left">GPG (GnuPG) cheatsheet</td>
<td class="org-left"><a href="https://cheatsheets.chaospixel.com/gnupg/">https://cheatsheets.chaospixel.com/gnupg/</a></td>
</tr>

<tr>
<td class="org-right">2026-02-18</td>
<td class="org-left">For Guix, a starting point for a minimal EXWM config</td>
<td class="org-left"><a href="https://codeberg.org/tuff-engin/GuixConfigurationSkeleton">https://codeberg.org/tuff-engin/GuixConfigurationSkeleton</a></td>
</tr>

<tr>
<td class="org-right">2026-02-18</td>
<td class="org-left">A great index of Guix resources</td>
<td class="org-left"><a href="https://github.com/franzos/awesome-guix">https://github.com/franzos/awesome-guix</a></td>
</tr>

<tr>
<td class="org-right">2026-02-05</td>
<td class="org-left">macOS has a great native internet speed test CLI: <code>networkquality -v</code>.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2026-02-04</td>
<td class="org-left">In Bash, use <code>qpdf input.pdf --overlay watermark.pdf --to=1 -- --replace-input</code> to add a watermark to the first page of a PDF.</td>
<td class="org-left"><a href="shell:man%20qpdf">shell:man%20qpdf</a></td>
</tr>

<tr>
<td class="org-right">2026-02-02</td>
<td class="org-left">WeasyPrint v67 is a significant improvement. It might be the next level in FOSS HTML-&gt;PDF.</td>
<td class="org-left"><a href="https://www.courtbouillon.org/blog/00060-weasyprint-67/">https://www.courtbouillon.org/blog/00060-weasyprint-67/</a></td>
</tr>

<tr>
<td class="org-right">2026-02-02</td>
<td class="org-left">In Emacs, some tips on setting shell environment variables</td>
<td class="org-left"><a href="http://xahlee.info/emacs/emacs/emacs_env_var_paths.html">http://xahlee.info/emacs/emacs/emacs_env_var_paths.html</a></td>
</tr>

<tr>
<td class="org-right">2026-02-02</td>
<td class="org-left">In Emacs, <code>C-u M-s M-w</code> will execute a web search in a new eww buffer.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2026-02-01</td>
<td class="org-left">In Emacs, search the web natively in eww with <code>M-s M-w</code>.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Word-Search">info "(emacs) Word Search"</a></td>
</tr>

<tr>
<td class="org-right">2026-01-30</td>
<td class="org-left">Poppler might be the most robust FOSS PDF rendering library.</td>
<td class="org-left"><a href="https://poppler.freedesktop.org">https://poppler.freedesktop.org</a></td>
</tr>

<tr>
<td class="org-right">2026-01-30</td>
<td class="org-left">xpdf is a PDF reader with lots of useful utilities.</td>
<td class="org-left"><a href="https://www.xpdfreader.com/support.html">https://www.xpdfreader.com/support.html</a></td>
</tr>

<tr>
<td class="org-right">2026-01-30</td>
<td class="org-left">A book on MuPDF with great insights on PDF mechanics</td>
<td class="org-left"><a href="https://casper.mupdf.com/docs/mupdf_explored.pdf">https://casper.mupdf.com/docs/mupdf_explored.pdf</a></td>
</tr>

<tr>
<td class="org-right">2026-01-30</td>
<td class="org-left">MuPDF seems to be a powerful PDF interpreter library. It is dual licensed under the GPL.</td>
<td class="org-left"><a href="https://mupdf.com">https://mupdf.com</a></td>
</tr>

<tr>
<td class="org-right">2026-01-30</td>
<td class="org-left">In Bash, use Poppler to easily extract images from a PDF: <code>pdfimages -all &lt;input.pdf&gt; &lt;output-dir&gt;</code></td>
<td class="org-left"><a href="shell:man%20pdfimages">shell:man%20pdfimages</a></td>
</tr>

<tr>
<td class="org-right">2026-01-29</td>
<td class="org-left">On macOS, use <code>sips -g profile &lt;input-image&gt;</code> to view the name of the image color profile.</td>
<td class="org-left"><a href="shell:man%20sips">shell:man%20sips</a></td>
</tr>

<tr>
<td class="org-right">2026-01-28</td>
<td class="org-left">In Emacs, an interesting Discord client.</td>
<td class="org-left"><a href="https://aliquote.org/post/discord-bitlbee/">https://aliquote.org/post/discord-bitlbee/</a></td>
</tr>

<tr>
<td class="org-right">2026-01-28</td>
<td class="org-left">In Emacs, you can run a one-off command in eshell from anywhere with <code>M-x eshell-command</code>.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/eshell.html#One_002dOff-Commands">info "(eshell) One-Off Commands"</a></td>
</tr>

<tr>
<td class="org-right">2026-01-28</td>
<td class="org-left">In Emacs, <code>C-x p e</code> starts eshell in the working directory.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Project-File-Commands">info "(emacs) Project File Commands"</a></td>
</tr>

<tr>
<td class="org-right">2026-01-28</td>
<td class="org-left">In Bash scripts, beginning your file with <code>set -euo pipefail</code> is a fairly clean way to debug errors.</td>
<td class="org-left"><a href="https://gist.github.com/mohanpedala/1e2ff5661761d3abd0385e8223e16425">https://gist.github.com/mohanpedala/1e2ff5661761d3abd0385e8223e16425</a></td>
</tr>

<tr>
<td class="org-right">2026-01-28</td>
<td class="org-left">A good introduction to modular Bash scripting</td>
<td class="org-left"><a href="https://www.funwithlinux.net/bash-scripting/breaking-down-complex-problems-modular-design-in-bash-scripts/#1-what-is-modular-design-in-bash">https://www.funwithlinux.net/bash-scripting/breaking-down-complex-problems-modular-design-in-bash-scripts/#1-what-is-modular-design-in-bash</a></td>
</tr>

<tr>
<td class="org-right">2026-01-28</td>
<td class="org-left">In Bash, use <code>ps aux -c</code> to list auxilary processes by command name.</td>
<td class="org-left"><a href="shell:man%20ps">shell:man%20ps</a></td>
</tr>

<tr>
<td class="org-right">2026-01-25</td>
<td class="org-left">In Bash, a great starting point for multiline print statements</td>
<td class="org-left"><a href="https://stackoverflow.com/a/57839821/28799158">https://stackoverflow.com/a/57839821/28799158</a></td>
</tr>

<tr>
<td class="org-right">2026-01-25</td>
<td class="org-left">Some common Bash parameter expansions</td>
<td class="org-left"><a href="https://stackoverflow.com/a/3362952">https://stackoverflow.com/a/3362952</a></td>
</tr>

<tr>
<td class="org-right">2026-01-23</td>
<td class="org-left">In Emacs magit, <code>C-u S</code> stages <i>all</i> files, even untracked (except for ignored).</td>
<td class="org-left"><a href="help:magit-stage-modified">help:magit-stage-modified</a></td>
</tr>

<tr>
<td class="org-right">2026-01-23</td>
<td class="org-left">pdfseparate and pdfunite are handy utilities for splitting and joining PDFs via the command line.</td>
<td class="org-left"><a href="https://superuser.com/a/1034450">https://superuser.com/a/1034450</a></td>
</tr>

<tr>
<td class="org-right">2026-01-22</td>
<td class="org-left">In Emacs eww, <code>R</code> enables eww's reader mode, <i>eww-readable</i>.</td>
<td class="org-left"><a href="help:eww-readable">help:eww-readable</a></td>
</tr>

<tr>
<td class="org-right">2026-01-22</td>
<td class="org-left">In Emacs, <code>M-: (setq VAR VALUE)</code> is indeed the quickest way to set a non-customizable variable.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Examining">info "(emacs) Examining and Setting Variables"</a></td>
</tr>

<tr>
<td class="org-right">2026-01-20</td>
<td class="org-left"><i>Mastering Emacs</i> has some good tips for dealing with secrets in Emacs.</td>
<td class="org-left"><a href="https://www.masteringemacs.org/article/keeping-secrets-in-emacs-gnupg-auth-sources">https://www.masteringemacs.org/article/keeping-secrets-in-emacs-gnupg-auth-sources</a></td>
</tr>

<tr>
<td class="org-right">2026-01-20</td>
<td class="org-left"><i>Pass</i> is a very vanilla Unix password manager.</td>
<td class="org-left"><a href="https://www.passwordstore.org">https://www.passwordstore.org</a></td>
</tr>

<tr>
<td class="org-right">2026-01-20</td>
<td class="org-left"><i>Shroud</i> is a simple GnuPG-based password manager written in Guile Scheme by David Thompson.</td>
<td class="org-left"><a href="https://dthompson.us/projects/shroud.html">https://dthompson.us/projects/shroud.html</a></td>
</tr>

<tr>
<td class="org-right">2026-01-19</td>
<td class="org-left">On macOS, <code>diskutil eject</code> accepts <code>NAME</code> from <code>diskutil list</code>.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2026-01-16</td>
<td class="org-left">ProseMirror appears to be a robust WYSIWYG collaborative HTML editor written in TypeScript.</td>
<td class="org-left"><a href="https://github.com/prosemirror">https://github.com/prosemirror</a></td>
</tr>

<tr>
<td class="org-right">2026-01-15</td>
<td class="org-left">A superior alternative to Adobe's own InDesign API documentation.</td>
<td class="org-left"><a href="https://www.indesignjs.de/extendscriptAPI/indesign-latest/index.html">https://www.indesignjs.de/extendscriptAPI/indesign-latest/index.html</a></td>
</tr>

<tr>
<td class="org-right">2026-01-08</td>
<td class="org-left">A convenient way to kill an app via bash: <code>pkill -i "app-name"</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2026-01-08</td>
<td class="org-left">Another description of PDF syntax</td>
<td class="org-left"><a href="https://dev.to/zubinajmera/pdf-syntax-101-a-simple-guide-to-pdf-object-types-and-how-they-work-1mmc">https://dev.to/zubinajmera/pdf-syntax-101-a-simple-guide-to-pdf-object-types-and-how-they-work-1mmc</a></td>
</tr>

<tr>
<td class="org-right">2026-01-08</td>
<td class="org-left">More info on how PDFs work</td>
<td class="org-left"><a href="https://dev.to/michael_lahr/why-is-pdf-so-hard-to-edit-3h3l">https://dev.to/michael_lahr/why-is-pdf-so-hard-to-edit-3h3l</a></td>
</tr>

<tr>
<td class="org-right">2026-01-08</td>
<td class="org-left">The PDF specification</td>
<td class="org-left"><a href="https://opensource.adobe.com/dc-acrobat-sdk-docs/standards/pdfstandards/pdf/PDF32000_2008.pdf">https://opensource.adobe.com/dc-acrobat-sdk-docs/standards/pdfstandards/pdf/PDF32000_2008.pdf</a></td>
</tr>

<tr>
<td class="org-right">2025-12-24</td>
<td class="org-left">To trim a video with ffmpeg, use <code>ffmpeg -i movie.mp4 -ss 00:00:03 -t 00:00:08 -async 1 cut.mp4</code>, where <code>-ss</code> is start time and <code>-t</code> is end time of clip after trim.</td>
<td class="org-left"><a href="https://stackoverflow.com/questions/18444194/cutting-multimedia-files-based-on-start-and-end-time-using-ffmpeg">https://stackoverflow.com/questions/18444194/cutting-multimedia-files-based-on-start-and-end-time-using-ffmpeg</a></td>
</tr>

<tr>
<td class="org-right">2025-12-19</td>
<td class="org-left">Hammerspoon is a Lua scripting engine for macOS.</td>
<td class="org-left"><a href="https://www.hammerspoon.org">https://www.hammerspoon.org</a></td>
</tr>

<tr>
<td class="org-right">2025-12-18</td>
<td class="org-left">One of many <i>okay</i> Bash cheat sheets</td>
<td class="org-left"><a href="https://devhints.io/bash">https://devhints.io/bash</a></td>
</tr>

<tr>
<td class="org-right">2025-12-17</td>
<td class="org-left">Bash process substitution is cool.</td>
<td class="org-left"><a href="bash.html#Process-Substitution">info "(bash) Process Substitution"</a>, <a href="https://youtu.be/2A4bs40scSo?si=6ypQ9MLstPsbMK6m">https://youtu.be/2A4bs40scSo?si=6ypQ9MLstPsbMK6m</a></td>
</tr>

<tr>
<td class="org-right">2025-12-17</td>
<td class="org-left">Concurrency is the key to fault-tolerant programming.</td>
<td class="org-left"><a href="https://youtu.be/cNICGEwmXLU?si=cYkpUjRDXVvr1EO4">https://youtu.be/cNICGEwmXLU?si=cYkpUjRDXVvr1EO4</a></td>
</tr>

<tr>
<td class="org-right">2025-12-10</td>
<td class="org-left">On macOS, <code>C-RET</code> opens the context menu for the cursor position.</td>
<td class="org-left"><a href="https://apple.stackexchange.com/a/476141/590533">https://apple.stackexchange.com/a/476141/590533</a></td>
</tr>

<tr>
<td class="org-right">2025-12-10</td>
<td class="org-left">In Emacs org-mode, <code>C-u C-u C-c TAB</code> expands a shrunk table.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Column-Width-and-Alignment">info "(org) Column Width and Alignment"</a></td>
</tr>

<tr>
<td class="org-right">2025-12-10</td>
<td class="org-left">In Emacs info-mode, see your history with <code>L</code>.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Help_002dInt">info "(emacs) Help-Int"</a></td>
</tr>

<tr>
<td class="org-right">2025-12-10</td>
<td class="org-left">In Emacs, set the default text size in the <code>default</code> face.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Standard-Faces">info "(emacs) Standard Faces"</a></td>
</tr>

<tr>
<td class="org-right">2025-12-09</td>
<td class="org-left">In Emacs, single letter bindings prefixed with <code>C-c</code> are reserved for the user.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Key-Bindings">info "(emacs) Key Bindings"</a></td>
</tr>

<tr>
<td class="org-right">2025-12-09</td>
<td class="org-left">Programming as a user (e.g. configuring Emacs) seems to be an entirely separate UX from development.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2025-12-08</td>
<td class="org-left">In Emacs with evil, substitute <code>TAB</code> for <code>org-cycle</code> with <code>zO</code> and <code>zo</code>.</td>
<td class="org-left"><code>C-h k zO</code>, <code>C-h k zo</code></td>
</tr>

<tr>
<td class="org-right">2025-12-04</td>
<td class="org-left">Tutorial for crochet beanie that might work well for paracord.</td>
<td class="org-left"><a href="https://youtu.be/ufCgyVbmWkI?si=8mJ7e8cSm6p9XNe5">https://youtu.be/ufCgyVbmWkI?si=8mJ7e8cSm6p9XNe5</a></td>
</tr>

<tr>
<td class="org-right">2025-12-03</td>
<td class="org-left">In Emacs, add prefix argument to <code>q</code> in view-mode buffers to kill the buffer instead of burying it.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Quitting-Windows">info "(elisp) Quitting Windows"</a></td>
</tr>

<tr>
<td class="org-right">2025-12-02</td>
<td class="org-left">In Geiser for Emacs, saving the current buffer in <code>/tmp/</code> and compiling with <code>C-c C-k</code> prior to <code>C-c C-a</code> seems to be a workaround for temp buffer name space issues.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2025-11-29</td>
<td class="org-left">In Guix, <i>soft-pinning</i> is an interesting idea.</td>
<td class="org-left"><a href="https://www.freakingpenguin.com/blog/guix-tricks-soft-pinning-channels-in-a-channelsscm-file.html">https://www.freakingpenguin.com/blog/guix-tricks-soft-pinning-channels-in-a-channelsscm-file.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-29</td>
<td class="org-left">An introduction to basic GnuPG usage.</td>
<td class="org-left"><a href="https://www.techtarget.com/searchSecurity/tutorial/How-to-use-GPG-to-encrypt-and-decrypt-files">https://www.techtarget.com/searchSecurity/tutorial/How-to-use-GPG-to-encrypt-and-decrypt-files</a></td>
</tr>

<tr>
<td class="org-right">2025-11-28</td>
<td class="org-left">In InDesign, the <i>indent to here</i> character can be used to define a content dependent indent for subsequent lines.</td>
<td class="org-left"><a href="https://helpx.adobe.com/indesign/using/tabs-indents.html">https://helpx.adobe.com/indesign/using/tabs-indents.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-26</td>
<td class="org-left">In Emacs, engine-mode looks to be a well-build package for leveraging search engines. Per the author's recommendation, I will try the built-in webjump first.</td>
<td class="org-left"><a href="https://elpa.nongnu.org/nongnu-devel/engine-mode.html">https://elpa.nongnu.org/nongnu-devel/engine-mode.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-24</td>
<td class="org-left">In Guix, <code>sudo guix pull</code> is basically never needed. An optimal system is configured to always use the user's guix package.</td>
<td class="org-left"><a href="https://logs.guix.gnu.org/guix/2025-11-24.log#222855">https://logs.guix.gnu.org/guix/2025-11-24.log#222855</a></td>
</tr>

<tr>
<td class="org-right">2025-11-21</td>
<td class="org-left">Some more ideas for handling secrets in Guix.</td>
<td class="org-left"><a href="https://gitlab.com/martin-baulig/config-and-setup/guix-packages/-/blob/work-wal-g/guix/extensions/secrets.scm?ref_type=heads">https://gitlab.com/martin-baulig/config-and-setup/guix-packages/-/blob/work-wal-g/guix/extensions/secrets.scm?ref_type=heads</a>, <a href="https://gitlab.com/martin-baulig/config-and-setup/guix-packages/-/blob/work-wal-g/packages/baulig/build/secrets-service.scm?ref_type=heads">https://gitlab.com/martin-baulig/config-and-setup/guix-packages/-/blob/work-wal-g/packages/baulig/build/secrets-service.scm?ref_type=heads</a></td>
</tr>

<tr>
<td class="org-right">2025-11-21</td>
<td class="org-left">Some ideas for handling secrets in Guix.</td>
<td class="org-left"><a href="https://www.freakingpenguin.com/blog/guix-tricks-managing-secrets-using-password-store-and-run-time-decryption-scripts.html">https://www.freakingpenguin.com/blog/guix-tricks-managing-secrets-using-password-store-and-run-time-decryption-scripts.html</a>, <a href="https://github.com/fishinthecalculator/sops-guix?tab=readme-ov-file">https://github.com/fishinthecalculator/sops-guix?tab=readme-ov-file</a></td>
</tr>

<tr>
<td class="org-right">2025-11-21</td>
<td class="org-left">Some useful info about <code>guix-for-channels</code> and other ways to configure channels within the system config.</td>
<td class="org-left"><a href="https://lists.gnu.org/archive/html/guix-devel/2024-12/msg00265.html">https://lists.gnu.org/archive/html/guix-devel/2024-12/msg00265.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-21</td>
<td class="org-left">An interesting argument: Macros are are necessary for language development, not regular use cases.</td>
<td class="org-left"><a href="https://qr.ae/pC4VPZ">https://qr.ae/pC4VPZ</a></td>
</tr>

<tr>
<td class="org-right">2025-11-21</td>
<td class="org-left">An interesting value comparison: <i>immutable data &gt; functions &gt; macros</i>.</td>
<td class="org-left"><a href="https://ericnormand.me/article/data-functions-macros-why">https://ericnormand.me/article/data-functions-macros-why</a></td>
</tr>

<tr>
<td class="org-right">2025-11-18</td>
<td class="org-left">In Emacs ERC, connect to ZNC with <code>(erc-tls :server "my_znc_server.com" :port 5555 :nick "dima5" :password "dima/oftc:zncpassword")</code>.</td>
<td class="org-left"><a href="https://notes.secretsauce.net/notes/2014/10/08_znc-and-erc.html">https://notes.secretsauce.net/notes/2014/10/08_znc-and-erc.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-17</td>
<td class="org-left">A great Guix config for reference.</td>
<td class="org-left"><a href="https://github.com/hiecaq/guix-config">https://github.com/hiecaq/guix-config</a></td>
</tr>

<tr>
<td class="org-right">2025-11-17</td>
<td class="org-left">In Guix, a way to pin specific packages to their own channel commits is in the works. They are calling it <i>inferiors</i>.</td>
<td class="org-left"><a href="https://guix.gnu.org/manual/en/html_node/Inferiors.html">https://guix.gnu.org/manual/en/html_node/Inferiors.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-16</td>
<td class="org-left">In Emacs, edit a file that requires root credentials with <code>C-x C-f /sudo::/path/to/file/</code>.</td>
<td class="org-left"><a href="https://emacs.stackexchange.com/a/56/49222">https://emacs.stackexchange.com/a/56/49222</a></td>
</tr>

<tr>
<td class="org-right">2025-11-16</td>
<td class="org-left">A helpful explanation of Emacs package management in Guix.</td>
<td class="org-left"><a href="https://www.youtube.com/live/gqmZjovuomc?si=4UgDFBHT5p7hnaXZ">https://www.youtube.com/live/gqmZjovuomc?si=4UgDFBHT5p7hnaXZ</a></td>
</tr>

<tr>
<td class="org-right">2025-11-16</td>
<td class="org-left">A good introduction to Guix.</td>
<td class="org-left"><a href="https://rendaw.gitlab.io/blog/55daefcf49e2.html">https://rendaw.gitlab.io/blog/55daefcf49e2.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-16</td>
<td class="org-left">In Guix, there is a built-in service for ZNC (the IRC bouncer).</td>
<td class="org-left"><a href="https://guix.gnu.org/manual/devel/en/html_node/Messaging-Home-Services.html">https://guix.gnu.org/manual/devel/en/html_node/Messaging-Home-Services.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-16</td>
<td class="org-left">In Guix, channels can be added directly to the system config with <code>guix-for-channels</code>. This will force a <code>guix pull</code> before every build (including the initial build).</td>
<td class="org-left"><a href="https://guix.gnu.org/manual/devel/en/html_node/Customizing-the-System_002dWide-Guix.html">https://guix.gnu.org/manual/devel/en/html_node/Customizing-the-System_002dWide-Guix.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-14</td>
<td class="org-left">In Vim <i>and</i> Emacs evil insert mode, <code>CTRL-T</code> and <code>CTRL-D</code> indents/outdents the current line.</td>
<td class="org-left"><code>:help i_CTRL-T</code>, <code>:help i_CTRL-D</code>, <code>C-h f evil-shift-right-line</code>, <code>C-h f evil-shift-left-line</code></td>
</tr>

<tr>
<td class="org-right">2025-11-14</td>
<td class="org-left">In Elisp, a great introduction to interactive functions.</td>
<td class="org-left"><a href="https://systemcrafters.net/learning-emacs-lisp/defining-functions-and-commands/">https://systemcrafters.net/learning-emacs-lisp/defining-functions-and-commands/</a></td>
</tr>

<tr>
<td class="org-right">2025-11-13</td>
<td class="org-left">For Guix, a custom service to daemonize kmonad.</td>
<td class="org-left"><a href="https://tannerhoelzel.com/gnu-shepherd-simple-service.html">https://tannerhoelzel.com/gnu-shepherd-simple-service.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-13</td>
<td class="org-left">In Guix, temp home environments (including dotfiles) can be created with <code>guix home container</code>.</td>
<td class="org-left"><a href="https://guix.gnu.org/manual/devel/en/html_node/Invoking-guix-home.html">https://guix.gnu.org/manual/devel/en/html_node/Invoking-guix-home.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-03</td>
<td class="org-left">In Guix, build a dev enviroment as a package from within the project repo.</td>
<td class="org-left"><a href="https://guix.gnu.org/cookbook/en/html_node/Software-Development.html">https://guix.gnu.org/cookbook/en/html_node/Software-Development.html</a></td>
</tr>

<tr>
<td class="org-right">2025-11-03</td>
<td class="org-left">In Emacs, image-dired is a thumbnail preview file manager.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Image_002dDired">info "(emacs) Image-Dired"</a></td>
</tr>

<tr>
<td class="org-right">2025-10-29</td>
<td class="org-left">A basic tutorial for manual manipulation of SVGs.</td>
<td class="org-left"><a href="https://www.aleksandrhovhannisyan.com/blog/svg-tutorial/#how-are-svgs-drawn">https://www.aleksandrhovhannisyan.com/blog/svg-tutorial/#how-are-svgs-drawn</a></td>
</tr>

<tr>
<td class="org-right">2025-10-29</td>
<td class="org-left">In Emacs, some great help on batch renaming files in dired.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Transforming-File-Names">info "(emacs) Transforming File Names"</a></td>
</tr>

<tr>
<td class="org-right">2025-10-24</td>
<td class="org-left">An interesting browser-based SVG path editor.s</td>
<td class="org-left"><a href="https://yqnn.github.io/svg-path-editor/">https://yqnn.github.io/svg-path-editor/</a></td>
</tr>

<tr>
<td class="org-right">2025-10-24</td>
<td class="org-left">In Emacs, an interesting preview mode for SVGs.</td>
<td class="org-left"><a href="https://monospace.games/misc/svg-preview-mode/">https://monospace.games/misc/svg-preview-mode/</a></td>
</tr>

<tr>
<td class="org-right">2025-10-20</td>
<td class="org-left">Some great tips for incremental adoption of plain text accounting.</td>
<td class="org-left"><a href="https://tylercipriani.com/blog/2024/10/24/plain-text-accounting/">https://tylercipriani.com/blog/2024/10/24/plain-text-accounting/</a></td>
</tr>

<tr>
<td class="org-right">2025-10-20</td>
<td class="org-left">In Emacs, some great tips on expanding the <code>use-package</code> macro.</td>
<td class="org-left"><a href="https://emacsnotes.wordpress.com/2023/07/02/migrating-to-use-package-tip-1-do-not-use-a-naive-macroexpand-to-grok-a-use-package-declaration-use-this-wrapper-instead/">https://emacsnotes.wordpress.com/2023/07/02/migrating-to-use-package-tip-1-do-not-use-a-naive-macroexpand-to-grok-a-use-package-declaration-use-this-wrapper-instead/</a></td>
</tr>

<tr>
<td class="org-right">2025-10-20</td>
<td class="org-left">In Emacs, <code>glyphless-display-mode</code> will show all invisible characters.</td>
<td class="org-left"><a href="https://lemmy.world/post/15944517">https://lemmy.world/post/15944517</a></td>
</tr>

<tr>
<td class="org-right">2025-10-16</td>
<td class="org-left">Guix has packages for Wireguard.</td>
<td class="org-left"><a href="https://enge.math.u-bordeaux.fr/blog/wireguard.html">https://enge.math.u-bordeaux.fr/blog/wireguard.html</a></td>
</tr>

<tr>
<td class="org-right">2025-10-16</td>
<td class="org-left">Wireguard is the new de-facto FOSS VPN.</td>
<td class="org-left"><a href="https://www.wireguard.com">https://www.wireguard.com</a></td>
</tr>

<tr>
<td class="org-right">2025-10-07</td>
<td class="org-left">Bash permits parenthesized sub-expressions. (Just be sure you escape the parentheses: <code>\(\)</code>.)</td>
<td class="org-left"><a href="https://unix.stackexchange.com/a/50613">https://unix.stackexchange.com/a/50613</a></td>
</tr>

<tr>
<td class="org-right">2025-09-25</td>
<td class="org-left">The documentation for the Emacs youtube-dl frontend is available on GitLab.</td>
<td class="org-left"><a href="https://gitlab.com/tuedachu/ytdl">https://gitlab.com/tuedachu/ytdl</a></td>
</tr>

<tr>
<td class="org-right">2025-09-23</td>
<td class="org-left">An interesting Hledger budgeting strategy.</td>
<td class="org-left"><a href="https://gist.github.com/ony/bbec599c0893e676b772559909b81de6">https://gist.github.com/ony/bbec599c0893e676b772559909b81de6</a></td>
</tr>

<tr>
<td class="org-right">2025-09-23</td>
<td class="org-left">A CSV importer for Ledger written in Elisp.</td>
<td class="org-left"><a href="https://codeberg.org/joostkremers/csv2ledger">https://codeberg.org/joostkremers/csv2ledger</a></td>
</tr>

<tr>
<td class="org-right">2025-09-23</td>
<td class="org-left">This is an interesting strategy for budgeting with org mode and Ledger.</td>
<td class="org-left"><a href="https://orgmode.org/worg/org-tutorials/weaving-a-budget.html">https://orgmode.org/worg/org-tutorials/weaving-a-budget.html</a></td>
</tr>

<tr>
<td class="org-right">2025-09-23</td>
<td class="org-left">Union Square and Co. is a publisher that has book designs which are an interesting blend of classic and modern.</td>
<td class="org-left"><a href="https://www.hachettebookgroup.com/imprint/union-square-co/">https://www.hachettebookgroup.com/imprint/union-square-co/</a></td>
</tr>

<tr>
<td class="org-right">2025-09-23</td>
<td class="org-left">In Emacs, track stats on <code>use-package</code> load times at init.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_node/use-package/Gathering-Statistics.html">https://www.gnu.org/software/emacs/manual/html_node/use-package/Gathering-Statistics.html</a></td>
</tr>

<tr>
<td class="org-right">2025-09-23</td>
<td class="org-left">This video is a must watch on containerizing with Guix.</td>
<td class="org-left"><a href="https://archive.fosdem.org/2020/schedule/event/guix/">https://archive.fosdem.org/2020/schedule/event/guix/</a></td>
</tr>

<tr>
<td class="org-right">2025-09-18</td>
<td class="org-left">In Emacs org-publish, use the prefix argument to force-rebuild.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/21259718/28799158">https://stackoverflow.com/a/21259718/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-09-18</td>
<td class="org-left">Skribe and Skribilo may be the scheme markup language I have been looking for.</td>
<td class="org-left"><a href="https://www.nongnu.org/skribilo/">https://www.nongnu.org/skribilo/</a></td>
</tr>

<tr>
<td class="org-right">2025-09-17</td>
<td class="org-left">In Emacs org mode, some useful tips for big tables (like this one) are available in the manual.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Column-Width-and-Alignment">info "(org) Column Width and Alignment"</a></td>
</tr>

<tr>
<td class="org-right">2025-09-17</td>
<td class="org-left">Some good pointers on publishing notes from <i>org-roam</i> via <i>org-publish</i>.</td>
<td class="org-left"><a href="https://commonplace.doubleloop.net/how-i-publish-my-wiki-with-org-publish">https://commonplace.doubleloop.net/how-i-publish-my-wiki-with-org-publish</a></td>
</tr>

<tr>
<td class="org-right">2025-09-17</td>
<td class="org-left">In Emacs, this is a simple workflow for find/replace across files.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/271136/28799158">https://stackoverflow.com/a/271136/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-09-16</td>
<td class="org-left">Some useful references for future exploration of Gnus for email.</td>
<td class="org-left"><a href="https://baty.net/posts/2025/03/using-gnus-for-email/">https://baty.net/posts/2025/03/using-gnus-for-email/</a>, <a href="https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/gnus-guide-en.org">https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/gnus-guide-en.org</a>, <a href="https://github.com/jwiegley/dot-emacs/blob/master/init.org">https://github.com/jwiegley/dot-emacs/blob/master/init.org</a></td>
</tr>

<tr>
<td class="org-right">2025-09-16</td>
<td class="org-left">In Emacs, <code>C-x C-v</code> kills the current buffer, replacing it with the new file/directory.</td>
<td class="org-left"><code>C-h k C-x C-v</code></td>
</tr>

<tr>
<td class="org-right">2025-09-11</td>
<td class="org-left">This is a good introduction to completions in Emacs (with keybinds).</td>
<td class="org-left"><a href="https://www.masteringemacs.org/article/understanding-minibuffer-completion">https://www.masteringemacs.org/article/understanding-minibuffer-completion</a></td>
</tr>

<tr>
<td class="org-right">2025-09-11</td>
<td class="org-left">macOS has massive overlap with Emacs keybindings.</td>
<td class="org-left"><a href="https://jblevins.org/log/kbd">https://jblevins.org/log/kbd</a></td>
</tr>

<tr>
<td class="org-right">2025-09-09</td>
<td class="org-left">Google Docs utilizes the <i>RE2</i> REGEX standard.</td>
<td class="org-left"><a href="https://support.google.com/docs/answer/62754#regular_expressions&amp;zippy=%2Csee-an-example">https://support.google.com/docs/answer/62754#regular_expressions&amp;zippy=%2Csee-an-example</a>, <a href="https://github.com/google/re2/blob/main/doc/syntax.txt">https://github.com/google/re2/blob/main/doc/syntax.txt</a></td>
</tr>

<tr>
<td class="org-right">2025-09-09</td>
<td class="org-left">In Google Docs, <code>\v</code> is the REGEX pattern for soft returns.</td>
<td class="org-left"><a href="https://appiphony.com/blog/create-a-hard-or-soft-return-in-google-docs#:~:text=You%20can%20also%20quickly%20identify,returns%2C%20search%20for%20%5Cv.">https://appiphony.com/blog/create-a-hard-or-soft-return-in-google-docs#:~:text=You%20can%20also%20quickly%20identify,returns%2C%20search%20for%20%5Cv.</a></td>
</tr>

<tr>
<td class="org-right">2025-09-09</td>
<td class="org-left">In InDesign, use a paragraph rule to add offset before the first paragraph in a text frame.</td>
<td class="org-left"><a href="https://graphicdesign.stackexchange.com/a/70460/211504">https://graphicdesign.stackexchange.com/a/70460/211504</a></td>
</tr>

<tr>
<td class="org-right">2025-09-05</td>
<td class="org-left">A some great instructions on loading <i>SICP</i> into Emacs info mode.</td>
<td class="org-left"><a href="https://zv.github.io/sicp-in-texinfo">https://zv.github.io/sicp-in-texinfo</a></td>
</tr>

<tr>
<td class="org-right">2025-09-05</td>
<td class="org-left">Emacs has a native tab mode! Type <code>C-x t 2</code> to create a new tab.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Tab-Bars">info "(emacs) Tab Bars"</a></td>
</tr>

<tr>
<td class="org-right">2025-09-04</td>
<td class="org-left">This is a great introduction to <i>xargs</i> in Bash.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/76130645/28799158">https://stackoverflow.com/a/76130645/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-09-03</td>
<td class="org-left">Emacs has some text object marking capabilities by default.</td>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Marking-Objects">info "(emacs) Marking Objects"</a></td>
</tr>

<tr>
<td class="org-right">2025-09-02</td>
<td class="org-left">In Emacs, launch a new eshell from the current dired directory via <code>C-u M-x eshell</code>. Navigate between these eshells by number: <code>C-3 M-x eshell</code> will open <code>*eshell*&lt;3&gt;</code>.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/6533447">https://stackoverflow.com/a/6533447</a></td>
</tr>

<tr>
<td class="org-right">2025-09-02</td>
<td class="org-left">In Emacs, org-roam has an Obsidian-style graph visualization.</td>
<td class="org-left"><a href="https://github.com/org-roam/org-roam-ui?tab=readme-ov-file#usage">https://github.com/org-roam/org-roam-ui?tab=readme-ov-file#usage</a></td>
</tr>

<tr>
<td class="org-right">2025-08-28</td>
<td class="org-left">In Emacs, <code>C-o</code> <i>opens</i> a new line after the point. This is a close as Emacs gets to Vim's <code>C-o</code> and <code>C-O</code>.</td>
<td class="org-left"><code>C-h k C-o</code></td>
</tr>

<tr>
<td class="org-right">2025-08-28</td>
<td class="org-left">In Emacs on macOS, the tile bar can be disabled for a cleaner look.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/72426586">https://stackoverflow.com/a/72426586</a></td>
</tr>

<tr>
<td class="org-right">2025-08-27</td>
<td class="org-left">The Inscape CLI does great conversions from SVG to image formats.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/14174624">https://stackoverflow.com/a/14174624</a></td>
</tr>

<tr>
<td class="org-right">2025-08-27</td>
<td class="org-left">In Guix, the <i>sops-guix</i> package is an interesting way to manage secrets.</td>
<td class="org-left"><a href="https://fishinthecalculator.me/blog/secrets-management-with-sops-guix.html">https://fishinthecalculator.me/blog/secrets-management-with-sops-guix.html</a></td>
</tr>

<tr>
<td class="org-right">2025-08-25</td>
<td class="org-left">In Lisp, comment convention recommends <code>;</code> for end-of-line comments and <code>;;</code> for comments on their own lines.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/6365579">https://stackoverflow.com/a/6365579</a>, <a href="https://www.lispworks.com/documentation/HyperSpec/Body/02_ddb.htm">https://www.lispworks.com/documentation/HyperSpec/Body/02_ddb.htm</a></td>
</tr>

<tr>
<td class="org-right">2025-08-22</td>
<td class="org-left">In Emacs, type <code>C-q</code> to insert a literal character regardless of bindings. (Think of it at the interactive equivalent of quoting symbols in Lisp.)</td>
<td class="org-left"><code>C-h k C-q</code></td>
</tr>

<tr>
<td class="org-right">2025-08-22</td>
<td class="org-left">In Emacs, evaluate <code>(insert (format-time-string "%Y-%m-%d"))</code> to insert the current date in <i>YYYY-MM-DD</i> format.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2025-08-22</td>
<td class="org-left">In Emacs, <i>devil-mode</i> may be the best modifier-less minor mode.</td>
<td class="org-left"><a href="https://github.com/susam/devil">https://github.com/susam/devil</a>, <a href="https://susam.github.io/devil/">https://susam.github.io/devil/</a></td>
</tr>

<tr>
<td class="org-right">2025-08-22</td>
<td class="org-left">In Emacs, <i>god-mode</i> beautifully addresses modifier fatigue.</td>
<td class="org-left"><a href="https://chrisdone.com/posts/god-mode/">https://chrisdone.com/posts/god-mode/</a>, <a href="https://github.com/emacsorphanage/god-mode">https://github.com/emacsorphanage/god-mode</a></td>
</tr>

<tr>
<td class="org-right">2025-08-20</td>
<td class="org-left">In Vim insert mode, <code>ga</code> will reveal information about the character under the cursor, including its Vim digraph.</td>
<td class="org-left"><code>:help ga</code></td>
</tr>

<tr>
<td class="org-right">2025-08-14</td>
<td class="org-left">This author has an interesting perspective on prepress via CSS paged media module.</td>
<td class="org-left"><a href="https://iangmcdowell.com/blog/posts/laying-out-a-book-with-css/">https://iangmcdowell.com/blog/posts/laying-out-a-book-with-css/</a></td>
</tr>

<tr>
<td class="org-right">2025-08-14</td>
<td class="org-left">SXML is a Guile Scheme standard for representing XML.</td>
<td class="org-left"><a href="https://www.gnu.org/software/guile/manual/html_node/SXML.html">https://www.gnu.org/software/guile/manual/html_node/SXML.html</a></td>
</tr>

<tr>
<td class="org-right">2025-08-13</td>
<td class="org-left">A potentially useful guide on setting up Gnus in Emacs.</td>
<td class="org-left"><a href="https://www.bounga.org/tips/2020/05/03/multiple-smtp-accounts-in-gnus-without-external-tools/">https://www.bounga.org/tips/2020/05/03/multiple-smtp-accounts-in-gnus-without-external-tools/</a></td>
</tr>

<tr>
<td class="org-right">2025-08-13</td>
<td class="org-left">50# offset (uncoated) paper stock has an average thickness of 0.004 in.</td>
<td class="org-left"><a href="https://www.hollandlitho.com/paper_thickness_and_weight_cutting_through_the_confusion.html">https://www.hollandlitho.com/paper_thickness_and_weight_cutting_through_the_confusion.html</a></td>
</tr>

<tr>
<td class="org-right">2025-08-12</td>
<td class="org-left">In Vim <i>and</i> Emacs evil, <code>CTRL-B</code> is bound to <code>&lt;PageUp&gt;</code>.</td>
<td class="org-left"><code>:help CTRL-B</code>, <code>C-h f evil-scroll-page-up</code></td>
</tr>

<tr>
<td class="org-right">2025-08-12</td>
<td class="org-left">In Emacs ELisp buffers, tab autocompletion of procedures can be enabled.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/7023515">https://stackoverflow.com/a/7023515</a></td>
</tr>

<tr>
<td class="org-right">2025-08-11</td>
<td class="org-left">This is a good place to start when learning Emacs.</td>
<td class="org-left"><a href="https://protesilaos.com/codelog/2019-12-20-vlog-switch-emacs/">https://protesilaos.com/codelog/2019-12-20-vlog-switch-emacs/</a></td>
</tr>

<tr>
<td class="org-right">2025-08-11</td>
<td class="org-left">Protesilaos Stavrou is a Greek thinker with potential insights on FOSS and Emacs.</td>
<td class="org-left"><a href="https://protesilaos.com/about/">https://protesilaos.com/about/</a></td>
</tr>

<tr>
<td class="org-right">2025-08-10</td>
<td class="org-left">This paper explains the rationale behind LAML.</td>
<td class="org-left"><a href="https://archives.iw3c2.org/www2002/_normark/laml/papers/lugm-laml.pdf">https://archives.iw3c2.org/www2002/_normark/laml/papers/lugm-laml.pdf</a></td>
</tr>

<tr>
<td class="org-right">2025-08-10</td>
<td class="org-left">LAML is perhaps the nicest Lisp markup language.</td>
<td class="org-left"><a href="https://people.cs.aau.dk/~normark/laml-distributions/laml/index.html">https://people.cs.aau.dk/~normark/laml-distributions/laml/index.html</a></td>
</tr>

<tr>
<td class="org-right">2025-08-10</td>
<td class="org-left">I guess I should not be surprised that there are many attempts at Lisp-as-markup.</td>
<td class="org-left"><a href="https://www.cliki.net/Lisp+Markup+Languages">https://www.cliki.net/Lisp+Markup+Languages</a></td>
</tr>

<tr>
<td class="org-right">2025-08-10</td>
<td class="org-left">Guix channels may be embedded in the system and home config files.</td>
<td class="org-left"><a href="https://guix.gnu.org/manual/devel/en/html_node/Customizing-the-System_002dWide-Guix.html">https://guix.gnu.org/manual/devel/en/html_node/Customizing-the-System_002dWide-Guix.html</a>, <a href="https://guix.gnu.org/manual/en/html_node/Guix-Home-Services.html">https://guix.gnu.org/manual/en/html_node/Guix-Home-Services.html</a></td>
</tr>

<tr>
<td class="org-right">2025-08-08</td>
<td class="org-left">In Bash, use <code>du -hs .</code> to get the size of the current directory.</td>
<td class="org-left"><code>man du</code>, <a href="https://stackoverflow.com/a/16662027">https://stackoverflow.com/a/16662027</a></td>
</tr>

<tr>
<td class="org-right">2025-08-07</td>
<td class="org-left">In Emacs, <code>M-n</code> to access minibuffer future history moving files between dired buffers.</td>
<td class="org-left"><a href="https://www.reddit.com/r/emacs/comments/1hevtrx/dired_faster_way_to_move_files/">https://www.reddit.com/r/emacs/comments/1hevtrx/dired_faster_way_to_move_files/</a>, <a href="https://engineering.collbox.co/post/working-faster-in-emacs-by-reading-the-future/">https://engineering.collbox.co/post/working-faster-in-emacs-by-reading-the-future/</a></td>
</tr>

<tr>
<td class="org-right">2025-08-02</td>
<td class="org-left">In Emacs, <code>C-x 4 0</code> closes the current window <i>and</i> buffer.</td>
<td class="org-left"><a href="https://superuser.com/q/1309765/2465866">https://superuser.com/q/1309765/2465866</a></td>
</tr>

<tr>
<td class="org-right">2025-08-01</td>
<td class="org-left">This is a great introduction into Vim-comparable motions in Emacs.</td>
<td class="org-left"><a href="https://www.masteringemacs.org/article/effective-editing-movement">https://www.masteringemacs.org/article/effective-editing-movement</a></td>
</tr>

<tr>
<td class="org-right">2025-07-16</td>
<td class="org-left">A potentially useful plugin for batching various InDesign exports.</td>
<td class="org-left"><a href="https://creativepro.com/files/kahrel/indesign/batch_convert.html">https://creativepro.com/files/kahrel/indesign/batch_convert.html</a></td>
</tr>

<tr>
<td class="org-right">2025-07-10</td>
<td class="org-left">This is a very provocative talk about interactive and visual programming.</td>
<td class="org-left"><a href="https://jackrusher.com/strange-loop-2022/">https://jackrusher.com/strange-loop-2022/</a></td>
</tr>

<tr>
<td class="org-right">2025-07-10</td>
<td class="org-left"><i>Interactive programming</i> is what I have been looking for regarding the <i>correct</i> way to interface with computers.</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Interactive_programming">https://en.wikipedia.org/wiki/Interactive_programming</a></td>
</tr>

<tr>
<td class="org-right">2025-07-09</td>
<td class="org-left">In Vim insert mode, type <code>&lt;C-o&gt;</code> to use one normal mode command without leaving insert mode.</td>
<td class="org-left"><code>:help i_CTRL-O</code></td>
</tr>

<tr>
<td class="org-right">2025-07-07</td>
<td class="org-left">Guix has a handy reference card for frequent commands.</td>
<td class="org-left"><a href="https://guix.gnu.org/guix-refcard.pdf">https://guix.gnu.org/guix-refcard.pdf</a></td>
</tr>

<tr>
<td class="org-right">2025-07-04</td>
<td class="org-left">LispKit is a library for developing Scheme on Apple devices. It has some interesting graphing capabilities.</td>
<td class="org-left"><a href="https://www.lisppad.app/libraries/lispkit/lispkit-draw-chart-bar">https://www.lisppad.app/libraries/lispkit/lispkit-draw-chart-bar</a></td>
</tr>

<tr>
<td class="org-right">2025-07-02</td>
<td class="org-left">These posts give the most detailed explanation of the InDesign MathML implementation than I have found to-date.</td>
<td class="org-left"><a href="https://indiscripts.com/post/2024/10/indesign-20-goes-to-mathml-1">https://indiscripts.com/post/2024/10/indesign-20-goes-to-mathml-1</a>, <a href="https://indiscripts.com/post/2025/03/indesign-20-goes-to-mathml-2">https://indiscripts.com/post/2025/03/indesign-20-goes-to-mathml-2</a></td>
</tr>

<tr>
<td class="org-right">2025-07-01</td>
<td class="org-left">This is a great basic usage of Guix Deploy.</td>
<td class="org-left"><a href="https://stumbles.id.au/getting-started-with-guix-deploy.html">https://stumbles.id.au/getting-started-with-guix-deploy.html</a></td>
</tr>

<tr>
<td class="org-right">2025-07-01</td>
<td class="org-left">Gimp supports automated workflows via scripting in Scheme!</td>
<td class="org-left"><a href="https://www.gimp.org/tutorials/Basic_Batch/">https://www.gimp.org/tutorials/Basic_Batch/</a></td>
</tr>

<tr>
<td class="org-right">2025-06-27</td>
<td class="org-left">In Vim, type <code>U</code> to toggle undo line.</td>
<td class="org-left"><code>:help U</code></td>
</tr>

<tr>
<td class="org-right">2025-06-27</td>
<td class="org-left">In Vim, <code>ZZ</code> is equivalent to <code>:x</code>.</td>
<td class="org-left"><code>:help ZZ</code></td>
</tr>

<tr>
<td class="org-right">2025-06-27</td>
<td class="org-left">In Vim, <code>&lt;C-d&gt;</code> will show all matching help topics for an incomplete help command.</td>
<td class="org-left"><code>:help c_CTRL-D</code></td>
</tr>

<tr>
<td class="org-right">2025-06-27</td>
<td class="org-left">In Vim, type <code>&lt;C-w&gt;p</code> to go to the previous window.</td>
<td class="org-left"><code>:help CTRL-W_p</code></td>
</tr>

<tr>
<td class="org-right">2025-06-20</td>
<td class="org-left">GUI apps can be started from the Linux virtual terminal via a number of methods.</td>
<td class="org-left"><a href="https://linuxconfig.org/how-to-run-x-applications-without-a-desktop-or-a-wm">https://linuxconfig.org/how-to-run-x-applications-without-a-desktop-or-a-wm</a>, <a href="https://superuser.com/q/550020">https://superuser.com/q/550020</a>, <a href="https://superuser.com/q/606811">https://superuser.com/q/606811</a></td>
</tr>

<tr>
<td class="org-right">2025-06-20</td>
<td class="org-left">David Thompson, a Guix contributor, gives some helpful perspective on hardware compatibility with Guix's FOSS stance.</td>
<td class="org-left"><a href="https://dthompson.us/posts/installing-guix-on-a-10th-gen-thinkpad-x1.html">https://dthompson.us/posts/installing-guix-on-a-10th-gen-thinkpad-x1.html</a></td>
</tr>

<tr>
<td class="org-right">2025-06-20</td>
<td class="org-left">In Vim, type <code>g&lt;C-g&gt;</code> to see information about the cursor position.</td>
<td class="org-left"><code>:help g_CTRL-G</code>, <code>:help word-count</code></td>
</tr>

<tr>
<td class="org-right">2025-06-20</td>
<td class="org-left">In Vim, type <code>:set ruler</code> to enable line/column/relative position info for the cursor in the bottom left of the window.</td>
<td class="org-left"><code>:help ruler</code>, <a href="https://unix.stackexchange.com/a/335468/727998">https://unix.stackexchange.com/a/335468/727998</a></td>
</tr>

<tr>
<td class="org-right">2025-06-19</td>
<td class="org-left">In Vim insert mode, type <code>&lt;C-k&gt;Co</code> for the copyright symbol: .</td>
<td class="org-left"><code>:digraphs</code>, <code>:help digraph</code></td>
</tr>

<tr>
<td class="org-right">2025-06-19</td>
<td class="org-left">In Vim command mode, type <code>:e &lt;cfile&gt;</code> to create a new file at the path under the cursor.</td>
<td class="org-left"><code>:help &lt;cfile&gt;</code></td>
</tr>

<tr>
<td class="org-right">2025-06-18</td>
<td class="org-left">This devlog has some helpful info about an initial Guix setup.</td>
<td class="org-left"><a href="https://simendsjo.me/blog/20240712085803-initial_guix_home_setup.html">https://simendsjo.me/blog/20240712085803-initial_guix_home_setup.html</a></td>
</tr>

<tr>
<td class="org-right">2025-06-17</td>
<td class="org-left">Guix deploy is a built-in feature for managing Guix on remote hardware.</td>
<td class="org-left"><a href="https://guix.gnu.org/manual/en/html_node/Invoking-guix-deploy.html">https://guix.gnu.org/manual/en/html_node/Invoking-guix-deploy.html</a></td>
</tr>

<tr>
<td class="org-right">2025-06-17</td>
<td class="org-left">Haunt is a static site generator written in Guile Scheme.</td>
<td class="org-left"><a href="https://dthompson.us/projects/haunt.html">https://dthompson.us/projects/haunt.html</a></td>
</tr>

<tr>
<td class="org-right">2025-06-17</td>
<td class="org-left">The man page for bash has a whole section about the readline (with keybinds.</td>
<td class="org-left"><code>man bash</code></td>
</tr>

<tr>
<td class="org-right">2025-06-17</td>
<td class="org-left">In Vim, Netrw cannot copy directories.</td>
<td class="org-left"><a href="https://vi.stackexchange.com/questions/12095/is-it-possible-to-clone-a-directory-with-netrw">https://vi.stackexchange.com/questions/12095/is-it-possible-to-clone-a-directory-with-netrw</a>, <a href="https://stackoverflow.com/questions/26958059/vim-netrw-copy-commands">https://stackoverflow.com/questions/26958059/vim-netrw-copy-commands</a></td>
</tr>

<tr>
<td class="org-right">2025-06-17</td>
<td class="org-left">Vim can be configured to run as a command server when GUI support is enabled.</td>
<td class="org-left"><code>:help clientserver</code>, <a href="https://subvisual.com/blog/posts/119-open-files-on-existing-vim-sessions/">https://subvisual.com/blog/posts/119-open-files-on-existing-vim-sessions/</a></td>
</tr>

<tr>
<td class="org-right">2025-06-16</td>
<td class="org-left">This is a great quick-start guide by the founder of Guix about using Guix Home.</td>
<td class="org-left"><a href="https://guix.gnu.org/blog/2022/keeping-ones-home-tidy/">https://guix.gnu.org/blog/2022/keeping-ones-home-tidy/</a></td>
</tr>

<tr>
<td class="org-right">2025-06-13</td>
<td class="org-left">This guy, Podiki, built a gaming rig with Guix System. He is also a major contributor to NonGuix.</td>
<td class="org-left"><a href="https://boilingsteam.com/how-i-built-my-new-linux-gaming-desktop-in-2021-with-amd-cpugpu-and-gnu-guix/">https://boilingsteam.com/how-i-built-my-new-linux-gaming-desktop-in-2021-with-amd-cpugpu-and-gnu-guix/</a></td>
</tr>

<tr>
<td class="org-right">2025-06-12</td>
<td class="org-left">In Vim, use <code>:helpg /pattern/</code> to search the Vim help via grep. Use <code>:cn</code> and <code>:cp</code> to navigate matches.</td>
<td class="org-left"><code>:help helpg</code></td>
</tr>

<tr>
<td class="org-right">2025-06-02</td>
<td class="org-left">System Crafters is a great community with info about Guix and Emacs.</td>
<td class="org-left"><a href="https://systemcrafters.net/">https://systemcrafters.net/</a></td>
</tr>

<tr>
<td class="org-right">2025-06-02</td>
<td class="org-left">Guix is a better, GNU clone of NixOS configured in Guile Scheme.</td>
<td class="org-left"><a href="https://guix.gnu.org/">https://guix.gnu.org/</a></td>
</tr>

<tr>
<td class="org-right">2025-06-02</td>
<td class="org-left">Literate programming is a way of documenting high-level code approaches by structuring the code files with prose.</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Literate_programming">https://en.wikipedia.org/wiki/Literate_programming</a></td>
</tr>

<tr>
<td class="org-right">2025-05-30</td>
<td class="org-left">In Zsh, <code>$OLDPWD</code> stores the value of the previous pwd. This is hugely useful for moving files around.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2025-05-30</td>
<td class="org-left">In Zsh, adding a glob to an expression makes the whole expression a glob. Make sure you are postfixing <code>*</code> if you want to see all matches for a that begin with the glob.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2025-05-30</td>
<td class="org-left">In Vim, use <code>&lt;C-w&gt;T</code> to move the current window to a new tab.</td>
<td class="org-left"><code>CTRL-W_T</code></td>
</tr>

<tr>
<td class="org-right">2025-05-30</td>
<td class="org-left">In Zsh, use <code>exec zsh</code> to totally reload Zsh (including environment variables).</td>
<td class="org-left"><a href="https://batsov.com/articles/2022/09/15/reload-zsh-configuration/">https://batsov.com/articles/2022/09/15/reload-zsh-configuration/</a></td>
</tr>

<tr>
<td class="org-right">2025-05-30</td>
<td class="org-left">top is way better than Activity Monitor.</td>
<td class="org-left"><code>man top</code></td>
</tr>

<tr>
<td class="org-right">2025-05-21</td>
<td class="org-left">In Vim, <code>nrformats+=alpha</code> must be set to increment/decrement letters with the below two commands.</td>
<td class="org-left"><code>:help nrformats</code></td>
</tr>

<tr>
<td class="org-right">2025-05-21</td>
<td class="org-left">In Vim visual modes, use <code>g&lt;C-x&gt;</code> to decrement.</td>
<td class="org-left"><code>:help v_g_CTRL-X</code></td>
</tr>

<tr>
<td class="org-right">2025-05-10</td>
<td class="org-left">In Vim visual modes, use <code>g&lt;C-a&gt;</code> to increment numbers on all lines.</td>
<td class="org-left"><code>:help v_g_CTRL-A</code>, <a href="https://www.joshmorony.com/totw/28/">https://www.joshmorony.com/totw/28/</a></td>
</tr>

<tr>
<td class="org-right">2025-05-07</td>
<td class="org-left">In Vim, use <code>`&lt;</code> and <code>`&gt;</code> to go to the beginning and end of the previous visual selection.</td>
<td class="org-left"><code>:help `&lt;</code>, <code>:help `&gt;</code>, <a href="https://stackoverflow.com/questions/11176159/how-to-jump-to-the-start-or-the-end-of-visual-selection-in-vim">https://stackoverflow.com/questions/11176159/how-to-jump-to-the-start-or-the-end-of-visual-selection-in-vim</a></td>
</tr>

<tr>
<td class="org-right">2025-05-06</td>
<td class="org-left">In Vim, <code>&lt;C-r&gt;&lt;C-r&gt;register</code> will paste from a register without executing special characters.</td>
<td class="org-left"><code>:help i_CTRL-R_CTRL-R</code>, <a href="https://vim.fandom.com/wiki/Pasting_registers">https://vim.fandom.com/wiki/Pasting_registers</a></td>
</tr>

<tr>
<td class="org-right">2025-05-06</td>
<td class="org-left">In Vim, you can execute arbitrary edits with <code>:g/pattern/normal somecommand</code>.</td>
<td class="org-left"><code>:help :g</code>, <a href="https://learnvim.irian.to/basics/the_global_command">https://learnvim.irian.to/basics/the_global_command</a></td>
</tr>

<tr>
<td class="org-right">2025-05-05</td>
<td class="org-left">In double entry accounting, payments made with credit cards and other liabilities are represented as outgoing (negative) values.</td>
<td class="org-left"><a href="https://www.reddit.com/r/plaintextaccounting/comments/eh9bz7/yet_another_question_about_credit_cards_and/">https://www.reddit.com/r/plaintextaccounting/comments/eh9bz7/yet_another_question_about_credit_cards_and/</a></td>
</tr>

<tr>
<td class="org-right">2025-05-02</td>
<td class="org-left">In Zsh use <code>bindkey -v</code> to enable Vi mode. (Insert mode is the default.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2025-05-01</td>
<td class="org-left">In Zsh use <code>setopt extended_glob; yourcmdhere (^negativepattern)</code> to apply a command via an exclusion.</td>
<td class="org-left"><a href="https://unix.stackexchange.com/a/541787/727998">https://unix.stackexchange.com/a/541787/727998</a></td>
</tr>

<tr>
<td class="org-right">2025-04-30</td>
<td class="org-left">In Vim insert mode, type <code>&lt;C-v&gt;160</code> to insert a no-break space.</td>
<td class="org-left"><a href="https://vimtricks.com/p/vimtrick-non-printable-characters/">https://vimtricks.com/p/vimtrick-non-printable-characters/</a></td>
</tr>

<tr>
<td class="org-right">2025-04-30</td>
<td class="org-left">In Vim, you can set various white space characters and markers with <code>listchars</code>.</td>
<td class="org-left"><code>:help listchars</code></td>
</tr>

<tr>
<td class="org-right">2025-04-30</td>
<td class="org-left">In Vim <code>R</code> replace mode, type <code>&lt;C-r&gt;"</code> to paste yanked contents.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/25413808/28799158">https://stackoverflow.com/a/25413808/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-04-28</td>
<td class="org-left">In Vim GREP, <code>\_.</code> matches any character <i>including a newline</i>.</td>
<td class="org-left"><code>:help /\_.</code>, <a href="https://stackoverflow.com/a/784203/28799158">https://stackoverflow.com/a/784203/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-04-28</td>
<td class="org-left">In Vim, use <code>:%s//~/</code> to redo the last substitution.</td>
<td class="org-left"><code>:help g&amp;</code>, <a href="https://vi.stackexchange.com/a/18107/54693">https://vi.stackexchange.com/a/18107/54693</a></td>
</tr>

<tr>
<td class="org-right">2025-04-28</td>
<td class="org-left">Pandoc can translate markdown fenced divs to ICML paragraph and character styles.</td>
<td class="org-left"><a href="https://github.com/jgm/pandoc/wiki/Importing-Markdown-in-InDesign">https://github.com/jgm/pandoc/wiki/Importing-Markdown-in-InDesign</a></td>
</tr>

<tr>
<td class="org-right">2025-04-28</td>
<td class="org-left">Processing manuscripts as XML may dramatically reduce the InDesign workload.</td>
<td class="org-left"><a href="https://helpx.adobe.com/indesign/using/importing-xml.html">https://helpx.adobe.com/indesign/using/importing-xml.html</a>, <a href="https://carijansen.com/indesign-xml-reference-guide/">https://carijansen.com/indesign-xml-reference-guide/</a>, <a href="https://stackoverflow.com/a/66267474/28799158">https://stackoverflow.com/a/66267474/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-04-24</td>
<td class="org-left">In Vim, <code>gq{motion}</code> will format the text. This is particularly useful for aligning text to a tab stop.</td>
<td class="org-left"><code>:help gq</code></td>
</tr>

<tr>
<td class="org-right">2025-04-23</td>
<td class="org-left">In Vim <code>@%</code> is the register for the current file (absolute path).</td>
<td class="org-left"><code>:help quote%</code></td>
</tr>

<tr>
<td class="org-right">2025-04-23</td>
<td class="org-left">In Vim, <code>:call delete(@%)</code> deletes the current (but leaves the buffer intact.</td>
<td class="org-left"><code>:help delete()</code>, <a href="https://stackoverflow.com/a/16679182">https://stackoverflow.com/a/16679182</a></td>
</tr>

<tr>
<td class="org-right">2025-04-23</td>
<td class="org-left">In Vim GREP, <code>\c</code> makes the selection case insensitive.</td>
<td class="org-left"><code>:help /\c</code>, <a href="https://superuser.com/a/713957">https://superuser.com/a/713957</a></td>
</tr>

<tr>
<td class="org-right">2025-04-23</td>
<td class="org-left">In Vim, <code>_</code> is the <i>current line</i> motion.</td>
<td class="org-left"><code>:help _</code>, <a href="https://stackoverflow.com/a/47864035/28799158">https://stackoverflow.com/a/47864035/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-04-22</td>
<td class="org-left">This video explores the importance of experience/familiarity/practice in learning at pace.</td>
<td class="org-left"><a href="https://www.youtube.com/watch?v=bSDprg24pEA">https://www.youtube.com/watch?v=bSDprg24pEA</a></td>
</tr>

<tr>
<td class="org-right">2025-04-22</td>
<td class="org-left">Vim has a built in print feature: <code>:hardcopy</code></td>
<td class="org-left"><code>:help :hardcopy</code>, <a href="https://stackoverflow.com/a/9693079">https://stackoverflow.com/a/9693079</a></td>
</tr>

<tr>
<td class="org-right">2025-04-22</td>
<td class="org-left">lpr is a shell service for printing files.</td>
<td class="org-left"><code>man lpr</code>, <a href="https://superuser.com/a/607380">https://superuser.com/a/607380</a></td>
</tr>

<tr>
<td class="org-right">2025-04-18</td>
<td class="org-left">In Vim command mode, <code>&lt;cfile&gt;</code> is replaced with the filename under the cursor.</td>
<td class="org-left"><code>:help &lt;cfile&gt;</code></td>
</tr>

<tr>
<td class="org-right">2025-04-18</td>
<td class="org-left">Lilypond is a musical markup language based on ABC and LaTeX. There is a (depreciated) Pandoc Lua filter for it already.</td>
<td class="org-left"><a href="https://lilypond.org">https://lilypond.org</a>, <a href="https://abcnotation.com">https://abcnotation.com</a>, <a href="https://github.com/pandoc/lua-filters/tree/master/lilypond">https://github.com/pandoc/lua-filters/tree/master/lilypond</a></td>
</tr>

<tr>
<td class="org-right">2025-04-18</td>
<td class="org-left">In Vim GREP, the <code>\%V</code> atom restricts the search to the last visual mode selection.</td>
<td class="org-left"><code>help /\%V</code>, <a href="https://vim.fandom.com/wiki/Search_and_replace_in_a_visual_selection#Substituting_in_a_visual_selection">https://vim.fandom.com/wiki/Search_and_replace_in_a_visual_selection#Substituting_in_a_visual_selection</a></td>
</tr>

<tr>
<td class="org-right">2025-04-18</td>
<td class="org-left">In Vim command mode, use <code>&lt;Up&gt;</code> and <code>&lt;Down&gt;</code> to scroll through history just like in the shell.</td>
<td class="org-left"><code>:help c_&lt;Up&gt;</code>, <code>:help c_&lt;Down&gt;</code></td>
</tr>

<tr>
<td class="org-right">2025-04-18</td>
<td class="org-left">In Vim, use <code>:ene=/</code>:enew= to begin editing a new file in the pwd.</td>
<td class="org-left"><code>:help :enew</code></td>
</tr>

<tr>
<td class="org-right">2025-04-17</td>
<td class="org-left">I finally remembered where I bought my favorite round thick-rimmed glasses.</td>
<td class="org-left"><a href="https://www.fytoo.com/product/FT0969?id=2239">https://www.fytoo.com/product/FT0969?id=2239</a></td>
</tr>

<tr>
<td class="org-right">2025-04-17</td>
<td class="org-left">Language is provably ambiguous.</td>
<td class="org-left"><a href="https://youtu.be/rWjUS2h2BfU?si=pITI0xi3Fq0LUz8p">https://youtu.be/rWjUS2h2BfU?si=pITI0xi3Fq0LUz8p</a></td>
</tr>

<tr>
<td class="org-right">2025-04-17</td>
<td class="org-left">The <i>royal order of adjectives</i> is a standard order for chaining adjectives in English.</td>
<td class="org-left"><a href="https://dictionary.cambridge.org/us/grammar/british-grammar/adjectives-order">https://dictionary.cambridge.org/us/grammar/british-grammar/adjectives-order</a></td>
</tr>

<tr>
<td class="org-right">2025-04-17</td>
<td class="org-left">ShellCheck is a Haskell shell script validator.</td>
<td class="org-left"><a href="https://hackage.haskell.org/package/ShellCheck">https://hackage.haskell.org/package/ShellCheck</a></td>
</tr>

<tr>
<td class="org-right">2025-04-16</td>
<td class="org-left">GitHub CLI extension leaves much to be desired. Currently, it can only process shell commands.</td>
<td class="org-left"><a href="https://docs.github.com/en/copilot/using-github-copilot/using-github-copilot-in-the-command-line">https://docs.github.com/en/copilot/using-github-copilot/using-github-copilot-in-the-command-line</a></td>
</tr>

<tr>
<td class="org-right">2025-04-16</td>
<td class="org-left">API keys are not a part of the ChatGPT Plus subscription. They are served by the OpenAI API platform.</td>
<td class="org-left"><a href="https://community.openai.com/t/api-access-as-a-chatgpt-plus-subscriber/573409/2">https://community.openai.com/t/api-access-as-a-chatgpt-plus-subscriber/573409/2</a></td>
</tr>

<tr>
<td class="org-right">2025-04-15</td>
<td class="org-left">InDesign's GREP supports word boundaries: <code>\b</code>. (It also supports the opening/closing boundaries: <code>\&lt;</code> and <code>\&gt;</code>.)</td>
<td class="org-left"><a href="https://www.oreilly.com/library/view/grep-in-indesign/9780596157173/ch04.html">https://www.oreilly.com/library/view/grep-in-indesign/9780596157173/ch04.html</a></td>
</tr>

<tr>
<td class="org-right">2025-04-10</td>
<td class="org-left">Zenburn is a Vim color scheme used natively for Pandoc syntax highlighting. It is so good, I am using it in my .vimrc.</td>
<td class="org-left"><a href="https://github.com/jnurmine/Zenburn">https://github.com/jnurmine/Zenburn</a></td>
</tr>

<tr>
<td class="org-right">2025-04-10</td>
<td class="org-left">SVG favicons are now a thing.</td>
<td class="org-left"><a href="https://css-tricks.com/svg-favicons-and-all-the-fun-things-we-can-do-with-them/">https://css-tricks.com/svg-favicons-and-all-the-fun-things-we-can-do-with-them/</a></td>
</tr>

<tr>
<td class="org-right">2025-04-10</td>
<td class="org-left">In CSS, use <code>display: flow-root;</code> to ensure parent elements min size accounts for floated elements.</td>
<td class="org-left"><a href="https://www.digitalocean.com/community/tutorials/css-no-more-clearfix-flow-root">https://www.digitalocean.com/community/tutorials/css-no-more-clearfix-flow-root</a></td>
</tr>

<tr>
<td class="org-right">2025-04-09</td>
<td class="org-left">In Vim insert mode, evaluate expressions (e.g.math) by typing <code>&lt;C-R&gt;=yourexpression&lt;CR&gt;</code>.</td>
<td class="org-left"><code>:help c_CTRL-R_=</code>, <a href="https://vimtricks.com/p/vim-calculator/">https://vimtricks.com/p/vim-calculator/</a></td>
</tr>

<tr>
<td class="org-right">2025-04-09</td>
<td class="org-left">In Vim, open file under the cursor in a new split with <code>CTRL-W_f</code>.</td>
<td class="org-left"><code>:help CTRL-W_f</code>, <a href="https://vimtricks.com/p/open-file-in-a-split/">https://vimtricks.com/p/open-file-in-a-split/</a></td>
</tr>

<tr>
<td class="org-right">2025-04-09</td>
<td class="org-left">In Vim, quickly switch to a one-time shell with <code>:shell</code> or <code>:sh</code>.</td>
<td class="org-left"><code>:help :shell</code></td>
</tr>

<tr>
<td class="org-right">2025-04-09</td>
<td class="org-left">In Git, use <code>git reset</code> to clear local changes since last commit.</td>
<td class="org-left"><a href="https://stackoverflow.com/a/1146981/28799158">https://stackoverflow.com/a/1146981/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-04-09</td>
<td class="org-left">In Vim, use <code>g&amp;</code> to repeat last substitution.</td>
<td class="org-left"><code>:help g&amp;</code>, <a href="https://vi.stackexchange.com/a/18107/54693">https://vi.stackexchange.com/a/18107/54693</a></td>
</tr>

<tr>
<td class="org-right">2025-04-09</td>
<td class="org-left">In Git, safely undo up to a prior commit without destroying history: <code>git revert --no-commit 0d1d7fc3..HEAD</code></td>
<td class="org-left"><a href="https://stackoverflow.com/a/21718540/28799158">https://stackoverflow.com/a/21718540/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-04-08</td>
<td class="org-left">Pandoc will treat iframes and other plain HTML as code blocks if there are more than four spaces worth of indentation.</td>
<td class="org-left"><a href="https://github.com/jgm/pandoc/issues/2244">https://github.com/jgm/pandoc/issues/2244</a></td>
</tr>

<tr>
<td class="org-right">2025-04-08</td>
<td class="org-left">In Vim, delete all but current buffer with <code>%bd\verte#</code></td>
<td class="org-left"><a href="https://stackoverflow.com/a/34050776/28799158">https://stackoverflow.com/a/34050776/28799158</a></td>
</tr>

<tr>
<td class="org-right">2025-04-08</td>
<td class="org-left">Quickly create a PDF with a subset of the pages of another PDF by selecting the pages in the sidebar, right-clicking, and selecting <i>Extract Pages&#x2026;</i>.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2025-04-04</td>
<td class="org-left">A joke about how deep the rabbit hole goes for solving computer problems.</td>
<td class="org-left"><a href="https://people.willamette.edu/~fruehr/haskell/evolution.html">https://people.willamette.edu/~fruehr/haskell/evolution.html</a></td>
</tr>

<tr>
<td class="org-right">2025-04-03</td>
<td class="org-left">The T2 chip on Apple computers can make installing Linux difficult.</td>
<td class="org-left"><a href="https://wiki.t2linux.org">https://wiki.t2linux.org</a></td>
</tr>

<tr>
<td class="org-right">2025-04-02</td>
<td class="org-left">Tufte CSS is a CSS styling philosophy derived from Edward Tufte's books and handouts. (It is very elegant.)</td>
<td class="org-left"><a href="https://edwardtufte.github.io/tufte-css/">https://edwardtufte.github.io/tufte-css/</a></td>
</tr>

<tr>
<td class="org-right">2025-04-02</td>
<td class="org-left"><code>git checkout -b [&lt;name-of-new-branch&gt;]</code> is a composition of <code>git branch</code> and <code>git checkout</code>.</td>
<td class="org-left"><a href="https://stackoverflow.com/questions/66882952/how-to-create-new-local-branch-and-switch-between-branches-in-git">https://stackoverflow.com/questions/66882952/how-to-create-new-local-branch-and-switch-between-branches-in-git</a></td>
</tr>

<tr>
<td class="org-right">2025-04-02</td>
<td class="org-left">Pandoc multiline tables best fit my needs for note taking. NOTE: They still convert to single-line.</td>
<td class="org-left"><a href="https://pandoc.org/MANUAL.html#extension-multiline_tables">https://pandoc.org/MANUAL.html#extension-multiline_tables</a></td>
</tr>

<tr>
<td class="org-right">2025-04-02</td>
<td class="org-left">In Vim, use <code>:echo expand("%:h")</code> to show the path of the current file.</td>
<td class="org-left"><code>:help :echo</code>, <code>:help expand()</code></td>
</tr>

<tr>
<td class="org-right">2025-04-02</td>
<td class="org-left">In Vim, <code>%</code> refers to the complete file path, <code>%:h</code> gets the head (path minus filename).</td>
<td class="org-left"><code>:help %:h</code></td>
</tr>

<tr>
<td class="org-right">2025-04-02</td>
<td class="org-left">In Vim, insert current time insert mode with <code>&lt;C-r&gt;=strftime('%F')&lt;CR&gt;</code>.</td>
<td class="org-left"><a href="https://superuser.com/questions/451340/how-to-insert-the-date-into-vim">https://superuser.com/questions/451340/how-to-insert-the-date-into-vim</a></td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="author">Author: Roger Farrell</p>
<p class="date">Created: 2026-02-26 Thu 20:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
